Revit 2027 API
WorksetConfiguration.Close Method
 Sets a group of user-created worksets to close.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Close(
	IList<WorksetId> worksetsToClose
)
Public Sub Close (
	worksetsToClose As IList(Of WorksetId)
)
public:
void Close(
	IList<WorksetId^>^ worksetsToClose
)
member Close :
        worksetsToClose : IList<WorksetId> -> unit
Parameters
worksetsToClose IList<WorksetId>
 The group of user-created worksets to close. Non-user-created worksets and invalid workset ids will be ignored.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Calling this method on a configuration created with options other than WorksetConfigurationOption.CloseAllWorksets will set these worksets to be explicitly closed. If all worksets are set to close, the configuration will be unchanged. Worksets other than the inputs are unaffected.
See Also
Reference
WorksetConfiguration Class
Autodesk.Revit.DB Namespace